
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьАвтораИзмененийДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Автор",Источник.Метаданные()) Тогда
		Источник.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаИзменения",Источник.Метаданные()) Тогда
		Источник.ДатаИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

//Устанавливает объект (Подразделение), закреплённый за текущим пользователем
Процедура УстановитьПараметрыСеанса(ИмяПараметра,УстановленныеПараметры) 								Экспорт
	
	Если ИмяПараметра = "ТекущееПодразделение" Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Если ЗначениеЗаполнено(ТекПользователь) И ТипЗнч(ТекПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			ПараметрыСеанса.ТекущееПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПользователь, "Подразделение");
		Иначе 
			ПараметрыСеанса.ТекущееПодразделение = Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Выполняет проверку завершения установки параметров сеанса и возможность дальнейшей работы
//Если объект у пользователя не задан, то это должен быть пользователь с полными правами и он имеет доступ ко всем объектам
//Если полных прав у пользователя нет, то завершаем сеанс с уведомлением, что пользователю необходимо обратиться 
//к администратору базы для настройки его прав и привязки к объекту
Функция ПроверитьЗаполнениеПараметровСеанса()                                                          	Экспорт
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущееПодразделение) Тогда
		Если Пользователи.РолиДоступны("ПолныеПрава") Тогда
			Возврат Истина;
		Иначе
	 		ЗаписьЖурналаРегистрации("У пользователя ''" + ПараметрыСеанса.ТекущийПользователь + "'' не определено подразделение (объект)",
	  		УровеньЖурналаРегистрации.Ошибка, , ,
	  		НСтр("ru = 'Работа системы завершена'"));
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции


#КонецОбласти
