
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПодразделениеОбъекта(Объект) Экспорт
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение",Объект.Метаданные()) Тогда
		Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Объект.Подразделение = ПараметрыСеанса.ТекущееПодразделение;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
