#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьТипыЗначенияФизЛицо();
	УстановитьТипыЗначенияПодразделение();
КонецПроцедуры
#КонецОбласти

//=====================================================================================================================

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры
#КонецОбласти

//=====================================================================================================================
 
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаименование()
	
	ТекФизЛицо = "";
	ТекПодразделение = "";
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Если ТипЗнч(Объект.Подразделение) = Тип("СправочникСсылка.Подразделения") Тогда
			ТекПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "Наименование");
		Иначе
			ТекПодразделение = Объект.Подразделение;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Если ТипЗнч(Объект.ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда			ТекФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ФизическоеЛицо, "Наименование");
		Иначе
			ТекФизЛицо = Объект.ФизическоеЛицо;
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекФизЛицо) И ЗначениеЗаполнено(ТекПодразделение) Тогда
		Объект.Наименование = ТекФизЛицо + " (" + ТекПодразделение + ")";
	ИначеЕсли ЗначениеЗаполнено(ТекФизЛицо) Тогда
		Объект.Наименование = ТекФизЛицо;
	ИначеЕсли ЗначениеЗаполнено(ТекПодразделение) Тогда
		Объект.Наименование = "(" + ТекПодразделение + ")";
	Иначе
		Объект.Наименование = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыЗначенияФизЛицо()
	ТипФизическиеЛица = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	Элементы.ФизическоеЛицо.ОграничениеТипа = ТипФизическиеЛица;
КонецПроцедуры

// Устанавливает ограничение типа для реквизита "Подразделение" на форме, позволяя выбирать только ссылки на справочник "Подразделения".
&НаСервере
Процедура УстановитьТипыЗначенияПодразделение()
	ТипПодразделения = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	Элементы.Подразделение.ОграничениеТипа = ТипПодразделения;
КонецПроцедуры

#КонецОбласти