
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НовоеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СписокПодразделений = ПолучитьСписокДоступныхПодразделений();
	Элементы.НовоеПодразделение.СписокВыбора.ЗагрузитьЗначения(СписокПодразделений);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаСменитьПодразделение(Команда)
	Если ЗначениеЗаполнено(НовоеПодразделение) И НЕ (НовоеПодразделение = ТекущееПодразделение) Тогда
		КомандаСменитьПодразделениеНаСервере();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КомандаСменитьПодразделениеНаСервере()
	ПараметрыСеанса.ТекущееПодразделение = НовоеПодразделение;
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Установлено подразделение %1",НовоеПодразделение));
	ТекущееПодразделение = НовоеПодразделение;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхПодразделений()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиПодразделенияПользователя.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи.ПодразделенияПользователя КАК ПользователиПодразделенияПользователя
		|ГДЕ
		|	ПользователиПодразделенияПользователя.Ссылка = &ТекПользователь";
	
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокПодразделений = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Возврат СписокПодразделений;
	
КонецФункции 
#КонецОбласти

