///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//                          ИСПОЛЬЗОВАНИЕ ФОРМЫ                               //
//
// Дополнительные параметры открытия формы подбора:
//
// РасширенныйПодбор - Булево - если Истина - открывается расширенная форма
//  подбора пользователей. Используется вместе с параметром ПараметрыРасширеннойФормыПодбора.
// ПараметрыРасширеннойФормыПодбора - Строка - адрес временного хранилища
//  со структурой ПользователиСлужебный.НовыеПараметрыРасширеннойФормыПодбора
//

#Область ОписаниеПеременных

&НаКлиенте
Перем ПоследняяГруппаПриАктивизации, ПоследняяГруппаПриНаведении;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ХранимыеПараметры = ХранимыеПараметры();
	ПользователиСлужебный.ПриСозданииФормыСпискаНаСервере(ЭтотОбъект);
	
	УстановитьВидПользователейВПараметрыДинамическихСписков(Параметры.Назначение);
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
		ВыбранныеПользователи = Неопределено;
		ПользователиСлужебный.НастроитьПараметрыРасширеннойФормыПодбора(ЭтотОбъект, ВыбранныеПользователи);
		Если ВыбранныеПользователи <> Неопределено Тогда
			ОбновитьСписокВыбранных(ВыбранныеПользователи, Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФормуПоИспользованиюГруппПользователей(Ложь, Истина);
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85()
	   И (Не ХранимыеПараметры.РежимВыбора
	      Или ХранимыеПараметры.РасширенныйПодбор) Тогда
		
		НастроитьРаботуВТакси();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПриОткрытииОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ВРег(ИмяСобытия) = ВРег("Запись_ГруппыВнешнихПользователей")
	 Или ВРег(ИмяСобытия) = ВРег("РазмещениеПользователейВГруппах")
	 Или ВРег(ИмяСобытия) = ВРег("Запись_ГруппыДоступа") Тогда
		
		ПодключитьОбработчикОжидания("ПриИзмененииГруппыПользователейОбработчикОжидания", 0.1, Истина);
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Запись_НаборКонстант") Тогда
		
		Если ВРег(Источник) = ВРег("ИспользоватьГруппыПользователей") Тогда
			ПодключитьОбработчикОжидания("ПриИзмененииИспользованияГруппПользователейОбработчикОжидания", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ТипЗнч(Настройки["ПоказыватьПользователейНижестоящихГрупп"]) = Тип("Булево") Тогда
		ПоказыватьПользователейНижестоящихГрупп = Настройки["ПоказыватьПользователейНижестоящихГрупп"];
	КонецЕсли;
	Элементы.СписокПоказатьПользователейНижестоящихГрупп.Пометка = ПоказыватьПользователейНижестоящихГрупп;
	
	Если Не ПоказыватьПользователейНижестоящихГрупп Тогда
		ОбновитьСодержимоеФормыПриИзмененииГруппы();
	КонецЕсли;
	
	ПользователиСлужебный.УстановитьЭлементУпорядочения(Группы, "Предопределенный", 0, "Убыв");
	ПользователиСлужебный.УстановитьЭлементУпорядочения(Группы, "Наименование");
	ПользователиСлужебный.УстановитьЭлементУпорядочения(Список, "Наименование");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНазначения", ЭтотОбъект);
	ПользователиСлужебныйКлиент.ВыбратьНазначение(ЭтотОбъект,
		НСтр("ru = 'Выбор вида пользователей'"), Ложь, Истина, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПользователейОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьВидПользователейВПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЭлементыСписковПриИзменении(Элемент)
	
	ПоказыватьЭлементыСписковПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппы

&НаКлиенте
Процедура ГруппыПриИзменении(Элемент)
	
	СписокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ХранимыеПараметры.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		Если ХранимыеПараметры.РасширенныйПодбор Тогда
			ГруппыВключитьВВыбранные(Неопределено);
		Иначе
			ГруппыВыборЗначения(Элемент, ВыбраннаяСтрока, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	
	Если Не ХранимыеПараметры.РасширенныйПодбор
	   И ХранимыеПараметры.ВыборГрупп Тогда
		
		ПоследняяГруппаПриАктивизации = Элементы.Группы.ТекущаяСтрока;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключитьОбработчикОжидания("ОбновитьСодержимоеФормыПриИзмененииГруппыОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ХранимыеПараметры.ВыборГрупп Тогда
		Возврат;
	КонецЕсли;
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
		ОбновитьСписокВыбранных(Значение,, Истина);
	Иначе
		ОповеститьОВыборе(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Группы.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Элементы.Группы.ТекущаяСтрока) Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения",
			Новый Структура("Родитель", Элементы.Группы.ТекущаяСтрока));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ГруппыВнешнихПользователей.ФормаОбъекта",
		ПараметрыФормы, Элементы.Группы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриНаведении(Элемент, Строка, Поле)
	
	Если Не ХранимыеПараметры.РасширенныйПодбор
	   И ХранимыеПараметры.ВыборГрупп Тогда
		
		ПоследняяГруппаПриНаведении = ?(Поле = Неопределено, Неопределено, Строка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект, Элемент, Строка);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ХранимыеПараметры.РасширенныйПодбор
	 Или Не ХранимыеПараметры.ВыборГрупп Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
		ДанныеСтроки = Неопределено;
	Иначе
		ДанныеСтроки = ?(Строка = Неопределено, Элемент.ТекущиеДанные,
			Элемент.ДанныеСтроки(Строка));
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Элементы.ГруппыВключитьВВыбранные.Видимость = Истина;
		Элементы.ГруппыИсключитьИзВыбранных.Видимость = Истина;
	Иначе
		Элементы.ГруппыВключитьВВыбранные.Видимость = Не ДанныеСтроки.Выбран;
		Элементы.ГруппыИсключитьИзВыбранных.Видимость = ДанныеСтроки.Выбран;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриИзмененииСоставаВыделенныхСтрок(Элемент)
	
	Если Не ХранимыеПараметры.РасширенныйПодбор
	   И ХранимыеПараметры.ВыборГрупп
	   И ЗначениеЗаполнено(ПоследняяГруппаПриНаведении)
	   И ЗначениеЗаполнено(ПоследняяГруппаПриАктивизации)
	   И ПоследняяГруппаПриНаведении <> ПоследняяГруппаПриАктивизации Тогда
		
		ПоследняяГруппаПриАктивизации = Неопределено;
		Индекс = Элемент.ВыделенныеСтроки.Найти(ПоследняяГруппаПриНаведении);
		Если Индекс <> Неопределено Тогда
			Элемент.ВыделенныеСтроки.Удалить(Индекс);
		Иначе
			Элемент.ВыделенныеСтроки.Добавить(ПоследняяГруппаПриНаведении);
		КонецЕсли;
	КонецЕсли;
	
	ПользователиСлужебныйКлиент.ОбновитьДоступностьКнопокВыбора(ЭтотОбъект);
	
	Если ХранимыеПараметры.РасширенныйПодбор
	   И ХранимыеПараметры.ВыборГрупп
	   И ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
		
		Элементы.ГруппыВключитьВВыбранные.Видимость = Истина;
		Элементы.ГруппыИсключитьИзВыбранных.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	СтараяГруппа = Элементы.Группы.ТекущаяСтрока;
	НоваяГруппа = Строка;
	
	Если НоваяГруппа = Неопределено
	 Или СтараяГруппа = НоваяГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтараяГруппаСТипомВсеОбъектыАвторизации =
		Элементы.Группы.ДанныеСтроки(СтараяГруппа).ВсеОбъектыАвторизации;
	
	Если НоваяГруппа = ХранимыеПараметры.ГруппаВсеПользователи
	   И СтараяГруппаСТипомВсеОбъектыАвторизации Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Из групп с типом участников ""Все пользователи заданного типа"" исключение пользователей невозможно.'"));
		Возврат;
	КонецЕсли;
	
	ВключитьВНовуюГруппу = (СтараяГруппа = ХранимыеПараметры.ГруппаВсеПользователи)
		Или СтараяГруппаСТипомВсеОбъектыАвторизации;
	
	ДанныеНовойГруппы = Элементы.Группы.ДанныеСтроки(НоваяГруппа);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Пользователи", ПараметрыПеретаскивания.Значение);
	Контекст.Вставить("ИсключитьИзСтаройГруппы", ХранимыеПараметры.ГруппаВсеПользователи = НоваяГруппа);
	Контекст.Вставить("ВключитьВНовуюГруппу", ВключитьВНовуюГруппу);
	Контекст.Вставить("НоваяГруппа", НоваяГруппа);
	Контекст.Вставить("НоваяГруппаПомеченаНаУдаление", ДанныеНовойГруппы.ПометкаУдаления);
	Контекст.Вставить("СтараяГруппа", СтараяГруппа);
	Контекст.Вставить("Перемещение", ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение);
	Контекст.Вставить("ПоказыватьПользователейНижестоящихГрупп", ПоказыватьПользователейНижестоящихГрупп);
	
	Оповещение = Новый ОписаниеОповещения("ГруппыПеретаскиваниеОбработкаОтветаНаВопрос", ЭтотОбъект, Контекст);
	
	ПользователиСлужебныйКлиент.ПриПеретаскиванииПользователейВГруппу(Контекст, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	СписокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
			СписокВключитьВВыбранные(Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(Элементы.Список) Тогда
		ВозможноСменитьПароль = Элементы.Список.ТекущиеДанные.ВозможноСменитьПароль;
	Иначе
		ВозможноСменитьПароль = Ложь;
	КонецЕсли;
	
	Элементы.СписокУстановитьПароль.Доступность = ВозможноСменитьПароль;
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		ПользователиСлужебныйКлиент.ОбновитьДоступностьКнопокВыбора(ЭтотОбъект);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СписокКонтекстноеМенюУстановитьПароль", "Доступность", ВозможноСменитьПароль);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
		СтандартнаяОбработка = Ложь;
		ОбновитьСписокВыбранных(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура("ГруппаНовогоВнешнегоПользователя",
		Элементы.Группы.ТекущаяСтрока);
	
	Если ЗначениеЗаполнено(ХранимыеПараметры.ОтборОбъектАвторизации) Тогда
		ПараметрыФормы.Вставить("ОбъектАвторизацииНовогоВнешнегоПользователя",
			ХранимыеПараметры.ОтборОбъектАвторизации);
	КонецЕсли;
	
	Если Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВнешниеПользователи.ФормаОбъекта",
		ПараметрыФормы, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущаяСтрока);
	ОткрытьФорму("Справочник.ВнешниеПользователи.ФормаОбъекта",
		ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ПользователиСлужебный.ДинамическийСписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект, Элемент, Строка);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ХранимыеПараметры.РасширенныйПодбор Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
		ДанныеСтроки = Неопределено;
	Иначе
		ДанныеСтроки = ?(Строка = Неопределено, Элемент.ТекущиеДанные,
			Элемент.ДанныеСтроки(Строка));
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Элементы.СписокВключитьВВыбранные.Видимость = Истина;
		Элементы.СписокИсключитьИзВыбранных.Видимость = Истина;
	Иначе
		Элементы.СписокВключитьВВыбранные.Видимость = Не ДанныеСтроки.Выбран;
		Элементы.СписокИсключитьИзВыбранных.Видимость = ДанныеСтроки.Выбран;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзмененииСоставаВыделенныхСтрок(Элемент)
	
	ПользователиСлужебныйКлиент.ОбновитьДоступностьКнопокВыбора(ЭтотОбъект);
	
	Если ХранимыеПараметры.РасширенныйПодбор
	   И ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
		
		Элементы.СписокВключитьВВыбранные.Видимость = Истина;
		Элементы.СписокИсключитьИзВыбранных.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФормаВыбратьВыделенные(Команда)
	
	Если ХранимыеПараметры.ВыборГрупп Тогда
		ВыбратьВыделенные(Элементы.Группы);
	КонецЕсли;
	
	ВыбратьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбратьИЗакрыть(Команда)
	
	Если Не ХранимыеПараметры.РасширенныйПодбор Тогда
		ФормаВыбратьВыделенные(Неопределено);
		Закрыть();
	Иначе
		ПользователиСлужебныйКлиент.ПредупредитьОВыделенныхПриРасширенномПодборе(ЭтотОбъект,
			Новый ОписаниеОповещения("ФормаВыбратьИЗакрытьПриРасширенномПодборе", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВставитьИзБуфераОбмена(Команда)
	
	ВставитьИзБуфераОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователиИнформационнойБазы(Команда)
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ПользователиИнформационнойБазы");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНазначитьГруппы(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
			ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				Элементы.Список.ТекущаяСтрока);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователи", ВыделенныеСтроки);
	ПараметрыФормы.Вставить("ВнешниеПользователи", Истина);
	
	ОткрытьФорму("ОбщаяФорма.ГруппыПользователей", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУстановитьПароль(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(ТекущиеДанные) Тогда
		ПользователиСлужебныйКлиент.ОткрытьФормуСменыПароля(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбратьТакси(Команда)
	
	ВыбратьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВключитьВВыбранные(Команда)
	
	ОбновитьСписокВыбранных(Элементы.Список.Имя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИсключитьИзВыбранных(Команда)
	
	ОбновитьСписокВыбранных(Элементы.Список.Имя, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоказатьНедействительныхПользователей(Команда)
	
	НовоеЗначение = Не Элементы.СписокПоказатьНедействительныхПользователей.Пометка;
	Элементы.СписокПоказатьНедействительныхПользователей.Пометка = НовоеЗначение;
	
	ПоказатьНедействительныхПользователей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыВыбратьТакси(Команда)
	
	ВыбратьВыделенные(Элементы.Группы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыВключитьВВыбранные(Команда)
	
	ОбновитьСписокВыбранных(Элементы.Группы.Имя, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыИсключитьИзВыбранных(Команда)
	
	ОбновитьСписокВыбранных(Элементы.Группы.Имя, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПоказатьПользователейНижестоящихГрупп(Команда)
	
	НовоеЗначение = Не Элементы.СписокПоказатьПользователейНижестоящихГрупп.Пометка;
	Элементы.СписокПоказатьПользователейНижестоящихГрупп.Пометка = НовоеЗначение;
	ПоказыватьПользователейНижестоящихГрупп = НовоеЗначение;
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытииОбработчикОжидания()
	
	Если ХранимыеПараметры.РежимВыбора Тогда
		ПользователиСлужебныйКлиент.НастроитьКнопкиПриВыбореИПодборе(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85()
	   И ХранимыеПараметры.РежимВыбора
	   И Не ХранимыеПараметры.РасширенныйПодбор Тогда
		
		НастроитьРаботуВТакси();
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//   * РежимВыбора - Булево
//   * ЗакрыватьПриВыборе - Булево
//   * ВыборГрупп - Булево
//   * ОтборОбъектАвторизации - ОпределяемыйТип.ВнешнийПользователь
//   * РасширенныйПодбор - Булево
//   * ИспользоватьГруппы - Произвольный
//   * ГруппаВсеПользователи - СправочникСсылка.ГруппыВнешнихПользователей
//   * ЗаголовокФормыПодбора - Строка
//   * ПоказыватьЭлементыСписков - Строка - предыдущее значение
//   * ГруппыОтображение - ОтображениеТаблицы - отображение перед включением отбора выбранных ссылок.
//   * ГруппаТекущаяСтрока - Неопределено, СправочникСсылка.ГруппыВнешнихПользователей
//
&НаСервере
Функция ХранимыеПараметры()
	
	Результат = Новый Структура;
	Результат.Вставить("РежимВыбора",               Параметры.РежимВыбора);
	Результат.Вставить("ЗакрыватьПриВыборе",        Параметры.ЗакрыватьПриВыборе <> Ложь);
	Результат.Вставить("ВыборГрупп",                Параметры.РежимВыбора И Параметры.ВыборГруппВнешнихПользователей);
	Результат.Вставить("ОтборОбъектАвторизации",    ?(Параметры.Отбор.Свойство("ОбъектАвторизации"),
	                                                    Параметры.Отбор.ОбъектАвторизации, Неопределено));
	Результат.Вставить("РасширенныйПодбор",         Параметры.РежимВыбора И Параметры.РасширенныйПодбор);
	Результат.Вставить("ИспользоватьГруппы",        ПолучитьФункциональнуюОпцию("ИспользоватьГруппыВнешнихПользователей"));
	Результат.Вставить("ГруппаВсеПользователи",     ВнешниеПользователи.ГруппаВсеВнешниеПользователи());
	Результат.Вставить("ЗаголовокФормыПодбора",     "");
	Результат.Вставить("ПоказыватьЭлементыСписков", "");
	Результат.Вставить("ГруппыОтображение",         Элементы.Группы.Отображение);
	Результат.Вставить("ГруппаТекущаяСтрока");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораНазначения(МассивТипов, ДополнительныеПараметры) Экспорт
	
	УстановитьВидПользователейВПараметрыДинамическихСписков(МассивТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидПользователейВПараметрыДинамическихСписков(МассивПустыхСсылок = Неопределено)
	
	Используется = МассивПустыхСсылок <> Неопределено И МассивПустыхСсылок.Количество() <> 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Группы,
		"Ссылка.Назначение.ТипПользователей",
		МассивПустыхСсылок, ВидСравненияКомпоновкиДанных.ВСписке, , Используется);
	
	МассивТипов = Новый Массив;
	Если Используется Тогда
		Для Каждого Элемент Из МассивПустыхСсылок Цикл
			МассивТипов.Добавить(ТипЗнч(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ТипОбъектаАвторизации",
		МассивТипов, ВидСравненияКомпоновкиДанных.ВСписке, , Используется);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоИспользованиюГруппПользователей(ИзменилосьИспользованиеГрупп = Ложь,
			УстановитьТекущуюСтроку = Ложь)
	
	Если ИзменилосьИспользованиеГрупп Тогда
		ХранимыеПараметры.ИспользоватьГруппы = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыВнешнихПользователей");
	КонецЕсли;
	
	Если УстановитьТекущуюСтроку Тогда
		ТекущаяСтрока = Параметры.ТекущаяСтрока;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("СправочникСсылка.ГруппыВнешнихПользователей") 
		   И ХранимыеПараметры.ИспользоватьГруппы Тогда
			
			Элементы.Группы.ТекущаяСтрока = ТекущаяСтрока;
		Иначе
			ТекущийЭлемент = Элементы.Список;
			Элементы.Группы.ТекущаяСтрока = ХранимыеПараметры.ГруппаВсеПользователи;
		КонецЕсли;
		
	ИначеЕсли Не ХранимыеПараметры.ИспользоватьГруппы Тогда
		
		Если Элементы.Группы.ТекущаяСтрока <> ХранимыеПараметры.ГруппаВсеПользователи Тогда
			Элементы.Группы.ТекущаяСтрока = ХранимыеПараметры.ГруппаВсеПользователи;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.ГруппыВнешнихПользователей)
	 Или ХранимыеПараметры.РасширенныйПодбор
	 Или ОбщегоНазначения.ЭтоАвтономноеРабочееМесто() Тогда
		
		Элементы.СписокНазначитьГруппы.Видимость = Ложь;
	Иначе
		Элементы.СписокНазначитьГруппы.Видимость = ХранимыеПараметры.ИспользоватьГруппы;
	КонецЕсли;
	
	ВыборГрупп = ХранимыеПараметры.ВыборГрупп
		И ХранимыеПараметры.ИспользоватьГруппы
		И ХранимыеПараметры.РежимВыбора;
	
	Если ХранимыеПараметры.РежимВыбора Тогда
		АвтоЗаголовок = Ложь;
		
		Если Не ХранимыеПараметры.ЗакрыватьПриВыборе Тогда
			// Режим подбора.
			Если ХранимыеПараметры.РасширенныйПодбор
			   И ЗначениеЗаполнено(ХранимыеПараметры.ЗаголовокФормыПодбора) Тогда
				
				Заголовок = ХранимыеПараметры.ЗаголовокФормыПодбора;
				
			ИначеЕсли ВыборГрупп Тогда
				Заголовок = НСтр("ru = 'Подбор внешних пользователей и групп'");
			Иначе
				Заголовок = НСтр("ru = 'Подбор внешних пользователей'");
			КонецЕсли;
		Иначе
			// Режим выбора.
			Если ВыборГрупп Тогда
				Заголовок = НСтр("ru = 'Выбор внешнего пользователя или группы'");
			Иначе
				Заголовок = НСтр("ru = 'Выбор внешнего пользователя'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьРаботуВТакси()
	
	ПользователиСлужебный.НастроитьРаботуВТакси(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииГруппыПользователейОбработчикОжидания()
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
	Элементы.Группы.Обновить();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользованияГруппПользователейОбработчикОжидания()
	
	НастроитьФормуПоИспользованиюГруппПользователей(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииГруппыОбработчикОжидания()
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСодержимоеФормыПриИзмененииГруппы()
	
	Если Не ХранимыеПараметры.ИспользоватьГруппы
	 Или Элементы.Группы.ТекущаяСтрока = ХранимыеПараметры.ГруппаВсеПользователи Тогда
		
		ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
			"ВсеВнешниеПользователи", Истина);
		
		ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
			"ВыбиратьИерархически", Истина);
		
		ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
			"ГруппаВнешнихПользователей", ХранимыеПараметры.ГруппаВсеПользователи);
	Иначе
		ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
			"ВсеВнешниеПользователи", ПоказыватьЭлементыСписков <> "");
		
		Если ЗначениеЗаполнено(Элементы.Группы.ТекущаяСтрока) Тогда
			ТекущиеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Элементы.Группы.ТекущаяСтрока, "ВсеОбъектыАвторизации");
		Иначе
			ТекущиеДанные = Неопределено;
		КонецЕсли;
		
		Если ТекущиеДанные <> Неопределено
		   И Не ТекущиеДанные.Свойство("ГруппировкаСтроки")
		   И ТекущиеДанные.ВсеОбъектыАвторизации Тогда
			
			ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
				"ВыбиратьИерархически", Истина);
		Иначе
			ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
				"ВыбиратьИерархически", ПоказыватьПользователейНижестоящихГрупп);
		КонецЕсли;
		
		ПользователиСлужебныйКлиентСервер.ОбновитьЗначениеПараметраКомпоновкиДанных(Список,
			"ГруппаВнешнихПользователей", Элементы.Группы.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриИзмененииНаСервере()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступомСлужебный = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступомСлужебный");
		МодульУправлениеДоступомСлужебный.ЗапуститьОбновлениеДоступа();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВставитьИзБуфераОбмена()
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.ВнешниеПользователи"));
	ПараметрыПоиска.Вставить("ПараметрыВыбора", Новый СписокЗначений);
	ПараметрыПоиска.Вставить("ПредставлениеПоля", Заголовок);
	ПараметрыПоиска.Вставить("Сценарий", "ПоискСсылок");
	
	ПараметрыВыполнения = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("ВставитьИзБуфераОбменаЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	
	МодульЗагрузкаДанныхИзФайлаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЗагрузкаДанныхИзФайлаКлиент");
	МодульЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗаполненияСсылок(ПараметрыПоиска, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбменаЗавершение(НайденныеОбъекты, ПараметрыВыполнения) Экспорт
	
	Если НайденныеОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВставитьИзБуфераОбменаЗавершениеСервер(НайденныеОбъекты);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьИзБуфераОбменаЗавершениеСервер(НайденныеОбъекты)
	
	ОбновитьСписокВыбранных(НайденныеОбъекты, Неопределено);
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСписокВыбранных(Знач ВыбранныеСсылки, Знач Добавить = Истина, Знач ВыборГруппы = Ложь)
	
	ПользователиСлужебный.ОбновитьСписокВыбранных(ЭтотОбъект,
		ВыбранныеСсылки, Добавить, ВыборГруппы);
	
	ПользователиСлужебный.ОбновитьКоличествоВОтбореПриПодборе(ЭтотОбъект);
	
	Если ПоказыватьЭлементыСписков <> "" Тогда
		ПоказыватьЭлементыСписковПриИзмененииНаСервере();
	КонецЕсли;
	
	ПользователиСлужебный.ОбновитьВыбранныеСсылкиДляСписка(Группы,
		Выбранные, Тип("СправочникСсылка.ГруппыВнешнихПользователей"));
	
	ПользователиСлужебный.ОбновитьВыбранныеСсылкиДляСписка(Список,
		Выбранные, Тип("СправочникСсылка.ВнешниеПользователи"));
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьЭлементыСписковПриИзмененииНаСервере()
	
	ПользователиСлужебный.ОбновитьОтборСсылокДляСписка(Группы,
		ПоказыватьЭлементыСписков, Выбранные, Тип("СправочникСсылка.ГруппыВнешнихПользователей"));
	
	ПользователиСлужебный.ОбновитьОтборСсылокДляСписка(Список,
		ПоказыватьЭлементыСписков, Выбранные, Тип("СправочникСсылка.ВнешниеПользователи"));
	
	Если ХранимыеПараметры.ПоказыватьЭлементыСписков = ПоказыватьЭлементыСписков Тогда
		Возврат;
	КонецЕсли;
	
	Если ХранимыеПараметры.ПоказыватьЭлементыСписков = "" Тогда
		ХранимыеПараметры.ГруппыОтображение   = Элементы.Группы.Отображение;
		ХранимыеПараметры.ГруппаТекущаяСтрока = Элементы.Группы.ТекущаяСтрока;
		Элементы.Группы.Отображение = ОтображениеТаблицы.Список;
		Элементы.ВидПользователей.Доступность = Ложь;
		Если ЗначениеЗаполнено(ВидПользователей) Тогда
			УстановитьВидПользователейВПараметрыДинамическихСписков(Неопределено);
		КонецЕсли;
		
	ИначеЕсли ПоказыватьЭлементыСписков = "" Тогда
		Элементы.Группы.Отображение = ХранимыеПараметры.ГруппыОтображение;
		Элементы.ВидПользователей.Доступность = Истина;
		Если ЗначениеЗаполнено(ВидПользователей) Тогда
			УстановитьВидПользователейВПараметрыДинамическихСписков(ВидПользователей.ВыгрузитьЗначения());
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Элементы.Группы.ТекущаяСтрока) Тогда
			Элементы.Группы.ТекущаяСтрока = ХранимыеПараметры.ГруппаТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	ХранимыеПараметры.ПоказыватьЭлементыСписков = ПоказыватьЭлементыСписков;
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	ПоказатьНедействительныхПользователей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьНедействительныхПользователей(Форма);
	
	Скрыть = Форма.ПоказыватьЭлементыСписков = ""
		И Не Форма.Элементы.СписокПоказатьНедействительныхПользователей.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "Недействителен", Ложь, , , Скрыть);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенные(Элемент)
	
	Если Не ХранимыеПараметры.РежимВыбора
	 Или Не ХранимыеПараметры.ВыборГрупп
	   И Элемент = Элементы.Группы Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.МножественныйВыбор Тогда
		Если ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
			ОповеститьОВыборе(Элемент.ВыделенныеСтроки);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда
		ОповеститьОВыборе(Элемент.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбратьИЗакрытьПриРасширенномПодборе(Результат, Контекст) Экспорт
	
	МассивПользователей = РезультатВыбора();
	ОповеститьОВыборе(МассивПользователей);
	Закрыть(МассивПользователей);
	
КонецПроцедуры

&НаСервере
Функция РезультатВыбора()
	
	ВыбранныеПользователи = Новый Массив;
	Для Каждого Выбранный Из Выбранные Цикл
		Если Выбранный.Изменение <> "-" Тогда
			ВыбранныеПользователи.Добавить(Выбранный.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеПользователи;
	
КонецФункции

#Область ПеретаскиваниеПользователей

// Обработчик вопроса.
//
// Параметры:
//  Ответ - КодВозвратаДиалога
//  Контекст - Структура:
//    * Пользователи - Массив из СправочникСсылка.Пользователи
//    * НоваяГруппа  - СправочникСсылка.ГруппыВнешнихПользователей
//    * СтараяГруппа - СправочникСсылка.ГруппыВнешнихПользователей
//    * Перемещение - Булево
//
&НаКлиенте
Процедура ГруппыПеретаскиваниеОбработкаОтветаНаВопрос(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеПользователю = ПеремещениеПользователяВНовуюГруппу(Контекст.Пользователи,
		Контекст.НоваяГруппа, Контекст.СтараяГруппа, Контекст.Перемещение);
	
	Если СообщениеПользователю.Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("Запись_ГруппыВнешнихПользователей");
	
	Если СообщениеПользователю.ЕстьОшибки = Ложь Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Перемещение пользователей'"),,
			СообщениеПользователю.Сообщение, БиблиотекаКартинок.ДиалогИнформация);
	Иначе
		ПоказатьПредупреждение(, СообщениеПользователю.Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеремещениеПользователяВНовуюГруппу(Знач МассивПользователей, Знач НоваяГруппа,
			Знач СтараяГруппа, Знач Перемещение)
	
	СообщениеПользователю = ПользователиСлужебный.ПеремещениеПользователяВНовуюГруппу(
		МассивПользователей, СтараяГруппа, НоваяГруппа, Перемещение);
	
	Элементы.Список.Обновить();
	Элементы.Группы.Обновить();
	
	Возврат СообщениеПользователю;
	
КонецФункции

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти